      * The IDENTIFICATION DIVISION provides metadata about our program,
      * and is one of two mandatory DIVISIONS in COBOL. The PROGRAM-ID
      * is the only required entry within this DIVISION.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLDPROGRAM.
      
      * The PROCEDURE DIVISION is where the program's logic is written.
       PROCEDURE DIVISION.

      * The DISPLAY statement prints the contents to the output device,
      * in this case, the console window.
           DISPLAY 'Hello, World'.

      * The STOP RUN statement ends the program
           STOP RUN.
